Project/Toir/src/InformationRegisters/торо_НастройкиСогласованияДокументовТОиР/торо_НастройкиСогласованияДокументовТОиР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НастройкиСогласованияДокументовТОиР</name>
  <resources>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.торо_ВидыДокументовСогласованияМероприятий</types>
      <types>EnumRef.торо_ВидыДокументовСогласованияРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>гкс_ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_МатрицаПереходаСтатусовДокументов/торо_МатрицаПереходаСтатусовДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МатрицаПереходаСтатусовДокументов</name>
  <attributes>
    <name>НомерСтатуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтатусаПерехода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТекущийСтатус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СледующийСтатус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_НастройкиСтатусовСогласованияДокументов/торо_НастройкиСтатусовСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НастройкиСтатусовСогласованияДокументов</name>
  <resources>
    <name>Начальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СогласованиеЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонСообщенияЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВПодборах</name>
    <comment>Не выводить ремонтные работы в форме подбора для документов, имеющих соответствующий статус</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретитьРедактирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьПометкуНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеОтображатьВСпискеЗадач</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>гкс_ПроводитьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>гкс_РазрешеноСоздаватьПодчиненные</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>гкс_ТребуетсяКомментарий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>НомерСтатуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ВидыДокументовСогласования/торо_ВидыДокументовСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВидыДокументовСогласования</name>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.торо_ВидыДокументовСогласованияМероприятий</types>
      <types>EnumRef.торо_ВидыДокументовСогласованияРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Регламентный</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ТекущиеСтатусыСогласованияДокументов/торо_ТекущиеСтатусыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ТекущиеСтатусыСогласованияДокументов</name>
  <resources>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </resources>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <type>
      <types>DefinedType.торо_СогласуемыеДокументы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ТекущиеСогласующиеДокументов/торо_ТекущиеСогласующиеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ТекущиеСогласующиеДокументов</name>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <type>
      <types>DefinedType.торо_СогласуемыеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Замещающий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ИсторияСтатусовСогласованияДокументов/торо_ИсторияСтатусовСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИсторияСтатусовСогласованияДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <type>
      <types>DefinedType.торо_СогласуемыеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаКого</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СтатусыСогласованияДокументовРемонтныхРабот/торо_СтатусыСогласованияДокументовРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыСогласованияДокументовРемонтныхРабот</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НеНапоминать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПроведениеДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <comment>TOIR20-782</comment>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>TOIR20-783</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <type>
      <types>DefinedType.торо_СогласуемыеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_ВидыДокументовСогласованияРемонтов/торо_ВидыДокументовСогласованияРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыДокументовСогласованияРемонтов</name>
  <enumValues>
    <name>торо_ВыявленныеДефекты</name>
  </enumValues>
  <enumValues>
    <name>торо_АктОВыполненииЭтапаРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_ПланГрафикРемонта</name>
  </enumValues>
  <enumValues>
    <name>торо_ЗаявкаНаРемонт</name>
  </enumValues>
  <enumValues>
    <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_ВнешнееОснованиеДляРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_АктПриемкиОборудования</name>
  </enumValues>
  <enumValues>
    <name>торо_ОстановочныеРемонты</name>
  </enumValues>
  <enumValues>
    <name>торо_ПланРаботПодразделения</name>
  </enumValues>
  <enumValues>
    <name>гкс_ЕВОБланк</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТекущийРуководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСтруктуреЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Организация</name>
    <comment>TOIR20-580</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/CommonModules/торо_РаботаССогласованиями/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция инициализирует реквизиты формы, используемые для согласования документов.
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма - форма документа.
//  ВидДокумента - ПеречислениеСсылка.торо_ВидыДокументовСогласованияРемонтов - вид документа.
//  Регламентный - Булево - это документ регламентного мероприятия.
//
Процедура ПриСозданииНаСервере(ЭтаФорма, ВидДокумента, Регламентный = Ложь) Экспорт
	
	ЭтаФорма.мХранитьИсториюСогласованияВДокументах = Константы.торо_ХранитьИсториюСогласованияВДокументах.Получить();
	ЭтаФорма.мИспользоватьСогласованиеДокументов = ПроверитьИспользованиеСогласованияДокументов(ВидДокумента, Регламентный);
	
	ОписаниеРевизита = Новый РеквизитФормы("СогласованиеТолькоПросмотр", Новый ОписаниеТипов("Булево"));
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(ОписаниеРевизита);
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Если ЭтаФорма.мИспользоватьСогласованиеДокументов Тогда
		
		Если Не ЗначениеЗаполнено(ЭтаФорма.Объект.Ссылка) Тогда
			
			Если НЕ ЗначениеЗаполнено(ЭтаФорма.Объект.СпособСогласования) Тогда
				ЭтаФорма.Объект.СпособСогласования = ПолучитьСпособСогласованияПоУмолчанию(ВидДокумента, ЭтаФорма.Объект.Организация, ЭтаФорма.Объект.Подразделение);
			КонецЕсли;
			
			ЭтаФорма.СтатусДокументаРегистр = ПолучитьНачальныйСтатус(ЭтаФорма.Объект.СпособСогласования);
			Если ЭтаФорма.мХранитьИсториюСогласованияВДокументах Тогда
				ЭтаФорма.Объект.СтатусДокумента = ЭтаФорма.СтатусДокументаРегистр;
			КонецЕсли;
			
			торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, ЭтаФорма.СтатусДокументаРегистр);

		Иначе
			
			ЭтаФорма.СтатусДокументаРегистр = ПолучитьТекущийСтатусСогласованияДокумента(ЭтаФорма.Объект.Ссылка);
			ПрочитатьРегистрыСогласования(ЭтаФорма);
			
		КонецЕсли;
		
		ОбновитьДеревоСогласующих(ЭтаФорма);
	
	КонецЕсли;
	
	торо_РаботаССогласованиямиКлиентСервер.УстановитьВидимостьСогласованиеИУтверждение(ЭтаФорма.мИспользоватьСогласованиеДокументов, ЭтаФорма.Объект, ЭтаФорма);
	
КонецПроцедуры

// Добавляет данные о согласовании в дополнительные свойства для проверки при проведении.
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма - форма документа.
//  ТекущийОбъект - ДокументОбъект - объект документа.
//
Процедура ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект) Экспорт
	
	Если ЭтаФорма.мИспользоватьСогласованиеДокументов Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СтатусДокумента", ЭтаФорма.СтатусДокументаРегистр);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("Согласующие", ЭтаФорма.СогласующиеРегистр.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

// Функция сохраняет необходимые данные о согласовании при записи документа.
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма - форма документа.
//  ТекущийОбъект - ДокументОбъект - объект документа.
//
Процедура ПриЗаписиНаСервере(ЭтаФорма, ТекущийОбъект) Экспорт
	
	Если ЭтаФорма.мИспользоватьСогласованиеДокументов Тогда
		торо_РаботаССогласованиямиКлиентСервер.ЗаписатьДеревоСогласования(ЭтаФорма);
		Если ЭтаФорма.СтатусДокументаРегистр = ПолучитьНачальныйСтатус(ТекущийОбъект.СпособСогласования) Тогда
			ЗаписатьРегистрыСогласования(ЭтаФорма, ТекущийОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Функция обновляет реквизит ДеревоСогласования.
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма - форма документа.
//  НовыйСпособСогласования - СправочникСсылка.торо_СпособыСогласованияДокументов - новый способ согласования.
// 
Процедура ОбновитьДеревоСогласующих(ЭтаФорма, НовыйСпособСогласования = Ложь) Экспорт
	
	Если НовыйСпособСогласования Тогда
		ЭтаФорма.СтатусДокументаРегистр = ПолучитьНачальныйСтатус(ЭтаФорма.Объект.СпособСогласования);
		Если ЭтаФорма.мХранитьИсториюСогласованияВДокументах Тогда
			ЭтаФорма.Объект.СтатусДокумента = ЭтаФорма.СтатусДокументаРегистр;
		КонецЕсли;
	КонецЕсли;
	
	Дерево = ПолучитьДеревоСогласования(ЭтаФорма.Объект.СпособСогласования, ЭтаФорма.СтатусДокументаРегистр, ЭтаФорма.СогласующиеРегистр.Выгрузить());
	ЭтаФорма.ЗначениеВРеквизитФормы(Дерево,"ДеревоСогласования");
	
	торо_РаботаССогласованиямиКлиентСервер.УстановитьВидимостьСогласованиеИУтверждение(ЭтаФорма.мИспользоватьСогласованиеДокументов, ЭтаФорма.Объект, ЭтаФорма);
		
КонецПроцедуры

// Функция устанавливает способ согласования для вида документов.
//
// Параметры:
//  ВидДокумента - ПеречислениеСсылка.торо_ВидыДокументовСогласованияРемонтов - вид документа.
//  Организация - СправочникСылка.Организации - организация документа.
//  ПодразделениеОрганизации - СправочникСсылка.СтруктураПредприятия - подразделение документа.
//
// Возвращаемое значение:
//  СправочникСсылка.торо_СпособыСогласованияДокументов - способ согласования по умолчанию.
//
Функция ПолучитьСпособСогласованияПоУмолчанию(ВидДокумента,Организация, ПодразделениеОрганизации) Экспорт		
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	торо_НастройкиСогласованияДокументовТОиР.ВидДокумента,
	|	торо_НастройкиСогласованияДокументовТОиР.Организация КАК Организация,
	|	торо_НастройкиСогласованияДокументовТОиР.Подразделение,
	|	торо_НастройкиСогласованияДокументовТОиР.СпособСогласования,
	|	ВЫБОР
	|		КОГДА торо_НастройкиСогласованияДокументовТОиР.ВидДокумента = &ВидДокумента
	|				И торо_НастройкиСогласованияДокументовТОиР.Организация = &Организация
	|				И торо_НастройкиСогласованияДокументовТОиР.Подразделение = &Подразделение
	|			ТОГДА 1
	|		КОГДА торо_НастройкиСогласованияДокументовТОиР.ВидДокумента = &ВидДокумента
	|				И торо_НастройкиСогласованияДокументовТОиР.Организация = &Организация
	|				И торо_НастройкиСогласованияДокументовТОиР.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА 2
	|		КОГДА торо_НастройкиСогласованияДокументовТОиР.ВидДокумента = &ВидДокумента
	|				И торо_НастройкиСогласованияДокументовТОиР.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|				И торо_НастройкиСогласованияДокументовТОиР.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА 3
	|		ИНАЧЕ 4
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	РегистрСведений.торо_НастройкиСогласованияДокументовТОиР КАК торо_НастройкиСогласованияДокументовТОиР
	|ГДЕ
	|	торо_НастройкиСогласованияДокументовТОиР.ВидДокумента = &ВидДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И НЕ ВыборкаДетальныеЗаписи.Приоритет = 4 Тогда
		СпособСогласования = ВыборкаДетальныеЗаписи.СпособСогласования;
	Иначе

		СпособСогласования = Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.ПустаяСсылка();
	
	КонецЕсли;
	
	Возврат СпособСогласования;
	
КонецФункции

// Функция получает начальный статус документа по способу согласования.
//
// Параметры:
//		СпособСогласования - СправочникиОбъекта.торо_СпособыСогласованияДокументов - способ согласования.
//
// Возвращаемое значение:
//		СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот - начальный статус документа.
//
Функция ПолучитьНачальныйСтатус(СпособСогласования) Экспорт
	
	Возврат торо_РаботаССогласованиямиПовтИсп.ПолучитьНачальныйСтатус(СпособСогласования);
	
КонецФункции 

// Функция получает список следующих статусов документа по способу согласования.
//
// Параметры:
//		СпособСогласования - СправочникиОбъекта.торо_СпособыСогласованияДокументов - способ согласования.
//		ТекущийСтатус - СправочникиОбъекта.торо_СтатусыСогласованияДокументовРемонтныхРабот - текущий статус документа.
//
// Возвращаемое значение:
//   СписокЗначений - список следующих статусов.
//
Функция ПолучитьСписокСледующихСтатусовДокумента(СпособСогласования, ТекущийСтатус) Экспорт
	
	СписокСледующихСтатусов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_МатрицаПереходаСтатусовДокументов.СледующийСтатус КАК СледующийСтатус
	|ИЗ
	|	РегистрСведений.торо_МатрицаПереходаСтатусовДокументов КАК торо_МатрицаПереходаСтатусовДокументов
	|ГДЕ
	|	торо_МатрицаПереходаСтатусовДокументов.ТекущийСтатус = &ТекущийСтатус
	|	И торо_МатрицаПереходаСтатусовДокументов.СпособСогласования = &СпособСогласования
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_МатрицаПереходаСтатусовДокументов.НомерСтатусаПерехода";
	
	Запрос.УстановитьПараметр("ТекущийСтатус", ТекущийСтатус);
	Запрос.УстановитьПараметр("СпособСогласования", СпособСогласования);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.СледующийСтатус) Тогда
			СписокСледующихСтатусов.Добавить(Выборка.СледующийСтатус);
		КонецЕсли; 
	КонецЦикла;
	
	Возврат СписокСледующихСтатусов;
	
КонецФункции 

// Функция получает список следующих статусов документа по способу согласования.
//
// Параметры:
//  СпособСогласования - СправочникОбъект.торо_СпособыСогласованияДокументов - способ согласования.
//  ТекущийСтатус - СправочникОбъект.торо_СтатусыСогласованияДокументовРемонтныхРабот - текущий статус документа.
//
// Возвращаемое значение:
//   СписокЗначений - список следующих статусов.
//
Функция ПолучитьСписокСледующихСтатусовДокументаДетально(СпособСогласования, ТекущийСтатус) Экспорт
	
	СписокСледующихСтатусов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_МатрицаПереходаСтатусовДокументов.СледующийСтатус КАК СледующийСтатус,
	               |	торо_МатрицаПереходаСтатусовДокументов.НомерСтатусаПерехода КАК НомерСтатусаПерехода
	               |ПОМЕСТИТЬ ВТ_СледующиеСтатусы
	               |ИЗ
	               |	РегистрСведений.торо_МатрицаПереходаСтатусовДокументов КАК торо_МатрицаПереходаСтатусовДокументов
	               |ГДЕ
	               |	торо_МатрицаПереходаСтатусовДокументов.ТекущийСтатус = &ТекущийСтатус
	               |	И торо_МатрицаПереходаСтатусовДокументов.СпособСогласования = &СпособСогласования
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_НастройкиСтатусовСогласованияДокументов.Статус КАК Статус,
	               |	торо_НастройкиСтатусовСогласованияДокументов.Начальный КАК Начальный
	               |ПОМЕСТИТЬ ВТ_НачальныеСтатусы
	               |ИЗ
	               |	РегистрСведений.торо_НастройкиСтатусовСогласованияДокументов КАК торо_НастройкиСтатусовСогласованияДокументов
	               |ГДЕ
	               |	торо_НастройкиСтатусовСогласованияДокументов.СпособСогласования = &СпособСогласования
	               |	И торо_НастройкиСтатусовСогласованияДокументов.Начальный = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СледующиеСтатусы.СледующийСтатус КАК СледующийСтатус,
	               |	ЕСТЬNULL(ВТ_НачальныеСтатусы.Начальный, ЛОЖЬ) КАК Начальный
	               |ИЗ
	               |	ВТ_СледующиеСтатусы КАК ВТ_СледующиеСтатусы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НачальныеСтатусы КАК ВТ_НачальныеСтатусы
	               |		ПО ВТ_СледующиеСтатусы.СледующийСтатус = ВТ_НачальныеСтатусы.Статус
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_СледующиеСтатусы.НомерСтатусаПерехода";
	
	Запрос.УстановитьПараметр("ТекущийСтатус", ТекущийСтатус);
	Запрос.УстановитьПараметр("СпособСогласования", СпособСогласования);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.СледующийСтатус) Тогда
			
			СтруктураВозврата = Новый Структура("СледующийСтатус, Начальный");
			ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
			СписокСледующихСтатусов.Добавить(СтруктураВозврата);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат СписокСледующихСтатусов;
	
КонецФункции // РассчитатьПродолжительностьВСекундах()

// Функция получает список данных по статусу документа по способу согласования.
//
// Параметры:
//		СпособСогласования - СправочникиОбъекта.торо_СпособыСогласованияДокументов - способ согласования.
//		СтатусДокумента - СправочникиОбъекта.торо_СтатусыСогласованияДокументовРемонтныхРабот - текущий статус документа.
//
// Возвращаемое значение:
//		СтруктураДанных - структура данных статуса.
//
Функция ПолучитьДанныеПоСтатусуДокумента(СпособСогласования, СтатусДокумента) Экспорт
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Начальный", Ложь);
	СтруктураДанных.Вставить("СогласованиеЗавершено", Ложь);
	СтруктураДанных.Вставить("ПроводитьДокумент", Ложь);
	СтруктураДанных.Вставить("ШаблонСообщенияЭлектроннойПочты", Неопределено);
	СтруктураДанных.Вставить("ЗапретитьРедактирование", Ложь);
	СтруктураДанных.Вставить("РазрешитьПометкуНаУдаление", Ложь);
	СтруктураДанных.Вставить("НеОтображатьВСпискеЗадач", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	торо_НастройкиСтатусовСогласованияДокументов.Начальный КАК Начальный,
	|	торо_НастройкиСтатусовСогласованияДокументов.СогласованиеЗавершено КАК СогласованиеЗавершено,
	|	торо_НастройкиСтатусовСогласованияДокументов.ПроводитьДокумент КАК ПроводитьДокумент,
	|	торо_НастройкиСтатусовСогласованияДокументов.ШаблонСообщенияЭлектроннойПочты КАК ШаблонСообщенияЭлектроннойПочты,
	|	торо_НастройкиСтатусовСогласованияДокументов.ЗапретитьРедактирование КАК ЗапретитьРедактирование,
	|	торо_НастройкиСтатусовСогласованияДокументов.РазрешитьПометкуНаУдаление КАК РазрешитьПометкуНаУдаление,
	|	торо_НастройкиСтатусовСогласованияДокументов.НеОтображатьВСпискеЗадач КАК НеОтображатьВСпискеЗадач
	|ИЗ
	|	РегистрСведений.торо_НастройкиСтатусовСогласованияДокументов КАК торо_НастройкиСтатусовСогласованияДокументов
	|ГДЕ
	|	торо_НастройкиСтатусовСогласованияДокументов.Статус = &ТекущийСтатус
	|	И торо_НастройкиСтатусовСогласованияДокументов.СпособСогласования = &СпособСогласования";
	
	Запрос.УстановитьПараметр("ТекущийСтатус", СтатусДокумента);
	Запрос.УстановитьПараметр("СпособСогласования", СпособСогласования);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции // РассчитатьПродолжительностьВСекундах()

// Функция проверяет, используется ли система согласования для документов данного типа.
//
// Параметры:
//  ИмяТипа - ПеречислениеСсылка.торо_ВидыДокументовСогласованияРемонтов - тип документа.
//  Регламентный - Булево - это документ регламентного мероприятия.
// Возвращаемое значение:
//  Булево - для документа включено согласование.
Функция ПроверитьИспользованиеСогласованияДокументов(Знач ИмяТипа = "", Регламентный = Ложь) Экспорт
	
	ФОИспользоватьСогласование = ПолучитьФункциональнуюОпцию("торо_ИспользоватьСогласование");
	КонстантаРемонты = Константы.торо_ИспользоватьСогласованиеДокументовРемонтов.Получить();
	КонстантаМероприятия = Константы.торо_ИспользоватьСогласованиеДокументовМероприятий.Получить();
	Если ИмяТипа = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ОстановочныеРемонты 
			или ИмяТипа = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_АктПриемкиОборудования
			Тогда
		СогласованиеИспользуется = Ложь;
	Иначе		
		СогласованиеИспользуется = Константы.ИспользоватьИнтеграциюС1СДокументооборот.Получить() И Константы.ИспользоватьПроцессыИЗадачи1СДокументооборота.Получить();
	КонецЕсли;
	
	Если НЕ ФОИспользоватьСогласование ИЛИ (НЕ КонстантаРемонты И НЕ КонстантаМероприятия) Тогда
		Возврат Ложь;
	ИначеЕсли ИмяТипа = "" Тогда
		Возврат НЕ СогласованиеИспользуется;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	торо_ВидыДокументовСогласования.ВидДокумента КАК ВидДокумента
		|ИЗ
		|	РегистрСведений.торо_ВидыДокументовСогласования КАК торо_ВидыДокументовСогласования
		|ГДЕ
		|	торо_ВидыДокументовСогласования.ВидДокумента = &ВидДокумента";
		
		// В случае формирования уведомлений передается строка с именем документа. На всякий случай возьмем в попытку.
		Если ТипЗнч(ИмяТипа) = Тип("Строка") Тогда

			Попытка
				Если Регламентный Тогда
					ИмяТипа = Перечисления.торо_ВидыДокументовСогласованияМероприятий[ИмяТипа];
				Иначе
					ИмяТипа = Перечисления.торо_ВидыДокументовСогласованияРемонтов[ИмяТипа];
				КонецЕсли;
			Исключение
				// Значит документ с таким именем не участвует в согласованиях и можем спокойно возвращать ложь.
				Возврат Ложь;
			КонецПопытки;

		КонецЕсли;
		
		Запрос.УстановитьПараметр("ВидДокумента", ИмяТипа);
		
		Результат = запрос.Выполнить();
		// согласование по документу используется
		Если Не Результат.Пустой() Тогда
			Возврат ?(Регламентный,КонстантаМероприятия,КонстантаРемонты) И НЕ СогласованиеИспользуется;
		// согласование по документу не используется	
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Функция возвращает статус согласования документа из регистра торо_ТекущиеСтатусыСогласованияДокументов.
// Параметры:
//  Документ - ДокументСсылка - документ, для которого получается статус.
// Возвращаемое значение:
//  СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот - статус согласования.
Функция ПолучитьТекущийСтатусСогласованияДокумента(Документ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		Возврат Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент,
	|	торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента
	|ИЗ
	|	РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК торо_ТекущиеСтатусыСогласованияДокументов
	|ГДЕ
	|	торо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтатусДокумента;
	КонецЕсли;
	
	Возврат Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.ПустаяСсылка();
	
КонецФункции

// Функция возвращает список лиц, уже согласовавших документ на последней итерации.
// Параметры:
//  Документ - ДокументСсылка - документ, для которого получается статус.
// Возвращаемое значение:
//  ТаблицаЗначений - таблица согласующих.
Функция ПолучитьТаблицуСогласующихДокумента(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ТекущиеСогласующиеДокументов.СтатусДокумента,
	|	торо_ТекущиеСогласующиеДокументов.Согласующий,
	|	торо_ТекущиеСогласующиеДокументов.Замещающий,
	|	торо_ТекущиеСогласующиеДокументов.Согласовано
	|ИЗ
	|	РегистрСведений.торо_ТекущиеСогласующиеДокументов КАК торо_ТекущиеСогласующиеДокументов
	|ГДЕ
	|	торо_ТекущиеСогласующиеДокументов.СогласуемыйДокумент = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультат;
	
КонецФункции

// Возвращает ключ записи регистра сведений торо_ИсторияСтатусовСогласованияДокументов по структуре ключевых полей.
//
// Параметры:
//		СтруктураКлюча - Структура - Структура с полями, соответствующмими измерениям регистра.
// Возвращаемое значение:
//		РегистрСведенийКлючЗаписи.торо_ИсторияСтатусовСогласованияДокументов - ключ записи. 
Функция ПолучитьКлючЗаписиИсторииСтатусовДокументов(СтруктураКлюча) Экспорт
	
	Возврат РегистрыСведений.торо_ИсторияСтатусовСогласованияДокументов.СоздатьКлючЗаписи(СтруктураКлюча);
		
КонецФункции

// Возвращает комментарий к статусу согласования из записи 
// регистра сведений торо_ИсторияСтатусовСогласованияДокументов,
// определяемой по значениям измерений, переданных в параметре.
//
// Параметры:
//		СтруктураКлюча - Структура - Структура с полями, соответствующмими измерениям регистра.
// Возвращаемое значение:
//		Строка - текст комментария к статусу согласования. 
Функция ПолучитьКомментарийКСтатусуСогласования(СтруктураКлюча) Экспорт
	
	Запись = РегистрыСведений.торо_ИсторияСтатусовСогласованияДокументов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, СтруктураКлюча);
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Запись.Комментарий;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗавершитьУтверждениеСтатусаДокумента(Форма, ПараметрыОповещения) Экспорт
	
	Объект = Форма.Объект;
	ВыбранныйСтатус = ПараметрыОповещения.ВыбранныйСтатус;
	
	Попытка
		
		СменитьСтатус = НужноИзменитьСтатусДокумента(Форма, ВыбранныйСтатус);
			
		СтруктураПараметров = Новый Структура;
		Если СменитьСтатус Тогда
			
			Форма.СтатусДокументаРегистр = ВыбранныйСтатус;
			Если Форма.мХранитьИсториюСогласованияВДокументах Тогда
				Объект.СтатусДокумента = Форма.СтатусДокументаРегистр;
			КонецЕсли;
			
			ПроводитьДокумент = Ложь;
			СтруктураДанных = ПолучитьДанныеПоСтатусуДокумента(Объект.СпособСогласования, Форма.СтатусДокументаРегистр);
			ПроводитьДокумент = СтруктураДанных.ПроводитьДокумент;
			
			Если ПроводитьДокумент И Объект.Проведен Тогда
				СтруктураПараметров.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
				СтруктураПараметров.Вставить("РежимПроведения", РежимПроведенияДокумента.Неоперативный);
			Иначе 
				СтруктураПараметров.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
		Иначе
			СтруктураПараметров.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		ЗаписатьРегистрыСогласования(Форма);
		Если Форма.мХранитьИсториюСогласованияВДокументах Тогда
			Форма.Записать(СтруктураПараметров);
		КонецЕсли;
		
		ДобавитьНапоминанияПоСтатусамСогласования(Объект.Ссылка);
		ОбновитьДеревоСогласующих(Форма);

		торо_РаботаССогласованиямиКлиентСервер.УстановитьВидимостьСогласованиеИУтверждение(Форма.мИспользоватьСогласованиеДокументов, Объект, Форма);
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение,, ОписаниеОшибки);
	КонецПопытки;
	
КонецПроцедуры

#Область ПодпискиНаСобытия

Процедура торо_СогласованиеОбработкаЗаполненияОбработчик(Источник) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Источник.СпособСогласования) Тогда
		СтруктураПараметров = ПараметрыИспользованияСогласованияДокумента(Источник);
		
		Если НЕ СтруктураПараметров.ИспользоватьСогласование Тогда
			Возврат;
		КонецЕсли;
		
		Источник.СпособСогласования = ПолучитьСпособСогласованияПоУмолчанию(СтруктураПараметров.ВидДокументаЗначение, Источник.Организация, Источник.Подразделение);
	КонецЕсли;
	
КонецПроцедуры

Процедура торо_СогласованиеПриКопированииДокументаПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	Источник.СтатусДокумента    = Неопределено;
	Источник.СпособСогласования = Неопределено;
	Источник.ИсторияСтатусов.Очистить();
	Источник.Согласующие.Очистить();
	
	СтруктураПараметров = ПараметрыИспользованияСогласованияДокумента(Источник);
	Если НЕ СтруктураПараметров.ИспользоватьСогласование Тогда
		Возврат;
	КонецЕсли;
	
	Источник.СпособСогласования = ПолучитьСпособСогласованияПоУмолчанию(СтруктураПараметров.ВидДокументаЗначение, Источник.Организация, Источник.Подразделение);
	
КонецПроцедуры

Процедура торо_СогласованиеПроверкиПередЗаписьюДокументаОбработчик(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = ПараметрыИспользованияСогласованияДокумента(Источник);
	
	Если НЕ СтруктураПараметров.ИспользоватьСогласование Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства = Источник.ДополнительныеСвойства;
	ДополнительныеСвойства.Вставить("Согласование_ВидДокумента", СтруктураПараметров.ВидДокументаМетаданные);
	ДополнительныеСвойства.Вставить("Согласование_Регламентный", СтруктураПараметров.Регламентный);
	ДополнительныеСвойства.Вставить("ИспользоватьСогласование",  СтруктураПараметров.ИспользоватьСогласование);
	
	// Если документ новый, то в регистре данных еще не будет,
	// но в ДополнительныеСвойства будет статус с формы документа.
	Если ДополнительныеСвойства.Свойство("СтатусДокумента") Тогда
		СтатусДокумента = ДополнительныеСвойства.СтатусДокумента;
	ИначеЕсли НЕ ЗначениеЗаполнено(Источник.Ссылка) Тогда
		// Документ записывается через код без открытия формы.
		// Следует выполнить установку начального статуса.
		СтатусДокумента = ПолучитьНачальныйСтатус(Источник.СпособСогласования);
		ЗаполнитьСвойстваДокументаПередЗаписьюБезОткрытияФормы(Источник, СтатусДокумента);
	Иначе
		СтатусДокумента = ПолучитьТекущийСтатусСогласованияДокумента(Источник.Ссылка);
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("СтатусДокумента", СтатусДокумента);
	
	// Проверить разрешение на пометку удаления
	Если Источник.ПометкаУдаления Тогда
		ПроверитьРазрешениеНаПометкуУдаленияПередЗаписьюДокумента(Источник.СпособСогласования, СтатусДокумента, Источник.ПометкаУдаления, Источник.Ссылка.ПометкаУдаления, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Проверить, можно ли проводить документ
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьРазрешениеПроведенияПоСтатусу(Источник.СпособСогласования, ДополнительныеСвойства, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если Источник.Организация <> Источник.Ссылка.Организация Тогда
		ДополнительныеСвойства.Вставить("ИзмениласьОрганизация", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура торо_СогласованиеПриЗаписиДокументаПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства = Источник.ДополнительныеСвойства;
	
	Если НЕ ДополнительныеСвойства.Свойство("ИспользоватьСогласование") ИЛИ ДополнительныеСвойства.ИспользоватьСогласование <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	СтатусДокумента = ДополнительныеСвойства.СтатусДокумента;
	
	Если ЗначениеЗаполнено(Источник.СпособСогласования) 
		И (СтатусДокумента = ПолучитьНачальныйСтатус(Источник.СпособСогласования)
		ИЛИ ДополнительныеСвойства.Свойство("ИзмениласьОрганизация"))	Тогда
		ДобавитьНапоминанияПоСтатусамСогласования(Источник.Ссылка, ДополнительныеСвойства);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Записать_СтатусДокумента") Тогда
		МенеджерЗаписи = РегистрыСведений.торо_ТекущиеСтатусыСогласованияДокументов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.СогласуемыйДокумент = Источник.Ссылка;
		МенеджерЗаписи.СтатусДокумента = СтатусДокумента;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Записать_ИсторияСтатусовСогласования") Тогда
		НаборДляЗаписи = РегистрыСведений.торо_ИсторияСтатусовСогласованияДокументов.СоздатьНаборЗаписей();
		НаборДляЗаписи.Отбор.СогласуемыйДокумент.Установить(Источник.Ссылка);
		Для каждого Строка из ДополнительныеСвойства.ИсторияСтатусовСогласования Цикл
			НоваяСтрока = НаборДляЗаписи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.СогласуемыйДокумент = Источник.Ссылка;
		КонецЦикла;
		НаборДляЗаписи.Записать(Истина);
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("Записать_Согласующие") Тогда
		НаборДляЗаписи = РегистрыСведений.торо_ТекущиеСогласующиеДокументов.СоздатьНаборЗаписей();
		НаборДляЗаписи.Отбор.СогласуемыйДокумент.Установить(Источник.Ссылка);
		Для каждого Строка из ДополнительныеСвойства.Согласующие Цикл
			НоваяСтрока = НаборДляЗаписи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.СогласуемыйДокумент = Источник.Ссылка;
		КонецЦикла;
		НаборДляЗаписи.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Строит дерево согласования для документа.
//
// Параметры:
//		СпособСогласования - СправочникСсылка.торо_СпособыСогласованияДокументов - способ соглсования.
//		СтатусДокумента - СправочникиОбъекта.торо_СтатусыСогласованияДокументовРемонтныхРабот - текущий статус документа.
//		ТаблицаСогласовавших - ТаблицаЗначений - таблица согласовавших.
//
// Возвращаемое значение:
//   ДеревоЗначений - дерево согласования.
//
Функция ПолучитьДеревоСогласования(СпособСогласования, СтатусДокумента, ТаблицаСогласовавших)
	
	ДеревоСогласования = Новый ДеревоЗначений;
	ДеревоСогласования.Колонки.Добавить("СтатусДокумента", Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот"));
	ДеревоСогласования.Колонки.Добавить("Согласующий", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ДеревоСогласования.Колонки.Добавить("Замещающий", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ДеревоСогласования.Колонки.Добавить("Согласовано", Новый ОписаниеТипов("Булево"));
	ДеревоСогласования.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
	ДеревоСогласования.Колонки.Добавить("Начальный", Новый ОписаниеТипов("Булево"));
	
	// Создадим строки дерева согласования.
	СписокСледующихСтатусов = ПолучитьСписокСледующихСтатусовДокументаДетально(СпособСогласования, СтатусДокумента);
	Для Каждого ЭлементСписка из СписокСледующихСтатусов Цикл
		
		СтрокаСтатус = ДеревоСогласования.Строки.Добавить();
		СтрокаСтатус.СтатусДокумента = ЭлементСписка.Значение.СледующийСтатус;
		СтрокаСтатус.Уровень         = 0;
		СтрокаСтатус.Начальный = ЭлементСписка.Значение.Начальный;
		
		МассивПользователей = СпособСогласования.ПорядокСогласования.НайтиСтроки(Новый Структура("ТекущийСтатус", ЭлементСписка.Значение.СледующийСтатус));
		
		Для Каждого ЭлементМассива Из МассивПользователей Цикл
			
			СтрокаСогласующий = СтрокаСтатус.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСогласующий, СтрокаСтатус);
			СтрокаСогласующий.Согласующий = ЭлементМассива.Пользователь;
			СтрокаСогласующий.Уровень     = 1;
			
			МассивЗамещающих = СпособСогласования.Замещающие.НайтиСтроки(Новый Структура("Пользователь, ТекущийСтатус", ЭлементМассива.Пользователь, ЭлементМассива.ТекущийСтатус));
			Для Каждого ЭлементМассиваЗамов Из МассивЗамещающих Цикл
				
				СтрокаЗамещающий = СтрокаСогласующий.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаЗамещающий, СтрокаСогласующий);
				СтрокаЗамещающий.Замещающий = ЭлементМассиваЗамов.Замещающий;
				СтрокаЗамещающий.Уровень    = 2;
			КонецЦикла; 
			
		КонецЦикла; 
		
	КонецЦикла;
	
	ПроставитьФлагиСогласованоВДереве(ДеревоСогласования, СписокСледующихСтатусов, ТаблицаСогласовавших);
	
	Возврат ДеревоСогласования;
	
КонецФункции 

Процедура ПроставитьФлагиСогласованоВДереве(ДеревоСогласования, СписокСледующихСтатусов, ТаблицаСогласовавших)
	
	// Отметим уже согласовавших сотрудников
	Для Каждого ЭлементСписка из СписокСледующихСтатусов Цикл
		
		МассивСогласовавших = ТаблицаСогласовавших.НайтиСтроки(Новый Структура("СтатусДокумента", ЭлементСписка.Значение.СледующийСтатус));
		Для Каждого СтрокаСогласовавших Из МассивСогласовавших Цикл
			МассивСтрокДС = ДеревоСогласования.Строки.НайтиСтроки(Новый Структура("СтатусДокумента, Согласующий, Замещающий",
			ЭлементСписка.Значение.СледующийСтатус, СтрокаСогласовавших.Согласующий, СтрокаСогласовавших.Замещающий), Истина);
			
			Для Каждого СтрокаДС Из МассивСтрокДС Цикл
				СтрокаДС.Согласовано = СтрокаСогласовавших.Согласовано;
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого Уровень1 из ДеревоСогласования.Строки Цикл
		
		Уровень2ВсеСогласовали = Истина;
		Для каждого Уровень2 из Уровень1.Строки Цикл
			
			Уровень3ВсеСогласовали = Ложь;
			Для каждого Уровень3 из Уровень2.Строки Цикл
				Если Уровень3.Согласовано Тогда
					Уровень3ВсеСогласовали = Истина;
					Прервать;	
				КонецЕсли;
			КонецЦикла;
			
			Если Уровень2.Строки.Количество() > 0 и Уровень3ВсеСогласовали	Тогда 
				Уровень2.Согласовано = Истина; 
			КонецЕсли;
			
			Если НЕ уровень2.Согласовано Тогда
				Уровень2ВсеСогласовали = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Уровень1.Строки.Количество()>0 и Уровень2ВсеСогласовали Тогда 
			Уровень1.Согласовано = Истина; 
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура записывает данные в регистры торо_ТекущиеСогласующиеДокументов,
// торо_ИсторияСтатусовСогласованияДокументов, торо_ТекущиеСтатусыСогласованияДокументов.
//
// Параметры:
//  Форма - УправляемаяФорма - форма документа.
//  ТекущийОбъект - ДокументОбъект - документ.
//
Процедура ЗаписатьРегистрыСогласования(Форма, ТекущийОбъект = Неопределено)
	
	Если ТекущийОбъект <> Неопределено Тогда
		Объект = ТекущийОбъект;
	Иначе
		Объект = Форма.Объект;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	// Запись таблицы Согласующие.
	Форма.СогласующиеРегистр.Очистить();
	
	МассивСогласованного = Новый Массив;			
	торо_РаботаССогласованиямиКлиентСервер.ЗаполнитьМассивИзДерева(МассивСогласованного, Форма.ДеревоСогласования.ПолучитьЭлементы());
	
	Для Каждого ЭлементМассива Из МассивСогласованного Цикл
		Если ЭлементМассива.Согласовано Тогда 
			ЗаполнитьЗначенияСвойств(Форма.СогласующиеРегистр.Добавить(), ЭлементМассива);
		КонецЕсли;
	КонецЦикла;
	
	НаборДляЗаписи = РегистрыСведений.торо_ТекущиеСогласующиеДокументов.СоздатьНаборЗаписей();
   НаборДляЗаписи.Отбор.СогласуемыйДокумент.Установить(Объект.Ссылка);
	Для каждого Строка из Форма.СогласующиеРегистр Цикл
		НоваяСтрока = НаборДляЗаписи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.СогласуемыйДокумент = Объект.Ссылка;
	КонецЦикла;
	НаборДляЗаписи.Записать(Истина);
	
	// Запись таблицы ИсторияСтатусов.
	НаборДляЗаписи = РегистрыСведений.торо_ИсторияСтатусовСогласованияДокументов.СоздатьНаборЗаписей();
   НаборДляЗаписи.Отбор.СогласуемыйДокумент.Установить(Объект.Ссылка);
	Для каждого Строка из Форма.ИсторияСтатусовРегистр Цикл
		НоваяСтрока = НаборДляЗаписи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.СогласуемыйДокумент = Объект.Ссылка;
	КонецЦикла;
	НаборДляЗаписи.Записать(Истина);

	// Запись текущего статуса документа.
	МенеджерЗаписи = РегистрыСведений.торо_ТекущиеСтатусыСогласованияДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СогласуемыйДокумент = Объект.Ссылка;
	МенеджерЗаписи.СтатусДокумента = Форма.СтатусДокументаРегистр;
	МенеджерЗаписи.Записать(Истина);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Процедура читает данные из регистра торо_ТекущиеСогласующиеДокументов,
// торо_ИсторияСтатусовСогласованияДокументов.
//
// Параметры:
//  Форма - УправляемаяФорма - форма документа.
//
Процедура ПрочитатьРегистрыСогласования(Форма)
	
	Объект = Форма.Объект;
	
	НаборЗаписей = Форма.РеквизитФормыВЗначение("ИсторияСтатусовРегистр");
	НаборЗаписей.Отбор.СогласуемыйДокумент.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	Форма.ЗначениеВреквизитФормы(НаборЗаписей, "ИсторияСтатусовРегистр");
	
	НаборЗаписей = Форма.РеквизитФормыВЗначение("СогласующиеРегистр");
	НаборЗаписей.Отбор.СогласуемыйДокумент.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	Форма.ЗначениеВреквизитФормы(НаборЗаписей, "СогласующиеРегистр");
		
КонецПроцедуры

Функция ПараметрыИспользованияСогласованияДокумента(Источник)

	СтруктураВозврата = Новый Структура;
	
	ИспользоватьСогласование	 = Ложь;
	Регламентный = Ложь;
	ЗначениеПеречисления = Неопределено;
	
	ВидДокумента = Метаданные.Перечисления.торо_ВидыДокументовСогласованияРемонтов.ЗначенияПеречисления.Найти(Источник.Метаданные().Имя);
	
	Если ВидДокумента = Неопределено Тогда
		ВидДокумента = Метаданные.Перечисления.торо_ВидыДокументовСогласованияМероприятий.ЗначенияПеречисления.Найти(Источник.Метаданные().Имя);
		Регламентный = Истина;	
	КонецЕсли;

	Если ВидДокумента <> Неопределено Тогда
		ЗначениеПеречисления = ?(НЕ Регламентный, Перечисления.торо_ВидыДокументовСогласованияРемонтов[ВидДокумента.Имя], Перечисления.торо_ВидыДокументовСогласованияМероприятий[ВидДокумента.Имя]);
		ИспользоватьСогласование = ПроверитьИспользованиеСогласованияДокументов(ЗначениеПеречисления, Регламентный);
	КонецЕсли;

	СтруктураВозврата.Вставить("Регламентный", Регламентный);
	СтруктураВозврата.Вставить("ИспользоватьСогласование", ИспользоватьСогласование);
	СтруктураВозврата.Вставить("ВидДокументаМетаданные", ВидДокумента);
	СтруктураВозврата.Вставить("ВидДокументаЗначение", ЗначениеПеречисления);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Проверяет, можно ли помечать документ на удаление.
// Параметры:
//		СпособСогласования - СправочникСсылка.торо_СпособыСогласованияДокументов - способ соглсования документа.
//		СтатусДокумента - СправочникиОбъекта.торо_СтатусыСогласованияДокументовРемонтныхРабот - текущий статус документа.
//		НоваяПометкаУдаления - Булево - новое значение пометки удаления.
//		СтараяПометкаУдаления - Булево - старое значение пометки удаления.
//		Отказ - Булево - устанавливается в истину, если пометку на удаление делать нельзя.
//
Процедура ПроверитьРазрешениеНаПометкуУдаленияПередЗаписьюДокумента(СпособСогласования, СтатусДокумента, НоваяПометкаУдаления, СтараяПометкаУдаления, Отказ) 
	
	Если НоваяПометкаУдаления = Истина Тогда
		
		СтруктураДанных = ПолучитьДанныеПоСтатусуДокумента(СпособСогласования, СтатусДокумента);
		РазрешитьПометкуНаУдаление = СтруктураДанных.РазрешитьПометкуНаУдаление;
		
		Если РазрешитьПометкуНаУдаление <> Истина Тогда
			
			Если СтараяПометкаУдаления <> НоваяПометкаУдаления Тогда
				ШаблонСообщения = НСтр("es='¡En el estatus ""%1"" marca a la desaparición es prohibida!';ru='В статусе ""%1"" пометка на удаление запрещена!';en='In the status ""%1"", the deletion mark is prohibited!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, СтатусДокумента);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Иначе
				НоваяПометкаУдаления = Ложь;
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет проверку, что при данном статусе согласования документа разрешено проведение.
//
// Параметры:
//  СпособСогласования - СправочникСсылка.торо_СпособыСогласованияДокументов - способ согласования.
//  ДополнительныеСвойства - Структура - дополнительные свойства.
//  Отказ - Булево - отказ от выполнения операции.
//
Процедура ПроверитьРазрешениеПроведенияПоСтатусу(СпособСогласования, ДополнительныеСвойства, Отказ)
	
	СтатусДокумента = ДополнительныеСвойства.СтатусДокумента;
	
	СтруктураДанных = ПолучитьДанныеПоСтатусуДокумента(СпособСогласования, СтатусДокумента);
	ПроводитьДокумент = СтруктураДанных.ПроводитьДокумент;
	
	Если Не (ПроводитьДокумент = Истина) Тогда
		
		Если ЗначениеЗаполнено(СтатусДокумента) Тогда
			ШаблонСообщения = НСтр("es='¡En el estatus ""%1"" realización del documento es imposible!';ru='В статусе ""%1"" проведение документа невозможно!';en='In the status ""%1"" the document cannot be posted!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтатусДокумента);
		Иначе
			ТекстСообщения = НСтр("es='No es rellenado el estatus corriente del documento. ¡La realización del documento es imposible!';ru='Не заполнен текущий статус документа. Проведение документа невозможно!';en='The current status of the document is not filled. Conducting a document is not possible!'");
		КонецЕсли;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Функция НужноИзменитьСтатусДокумента(Форма, ВыбранныйСтатус)
	
	СменитьСтатус = Ложь;
	СтрокаСтатус  = Новый Массив;
	Массив  = Форма.ДеревоСогласования.ПолучитьЭлементы();
	
	Для каждого Строка Из Массив Цикл
		Если Строка.СтатусДокумента = ВыбранныйСтатус Тогда
			СтрокаСтатус.Добавить(Строка);
		КонецЕсли; 
	КонецЦикла; 
	
	Если СтрокаСтатус.Количество() = 0 Тогда
		Возврат СменитьСтатус;
	КонецЕсли;
		
	КоличествоСогласовавших = 0;
	ОбщееКоличествоСтрок    = 0;
	
	Для Каждого СтрокаДЗ Из СтрокаСтатус Цикл
		ОбщееКоличествоСтрок = ОбщееКоличествоСтрок + СтрокаДЗ.ПолучитьЭлементы().Количество();
		
		Если СтрокаДЗ.Согласовано Тогда
			КоличествоСогласовавших = ОбщееКоличествоСтрок;
		Иначе
			Для Каждого СтрокаДЗЗ Из СтрокаДЗ.ПолучитьЭлементы() Цикл
				Если СтрокаДЗЗ.Согласовано Тогда
					КоличествоСогласовавших = КоличествоСогласовавших + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 
	КонецЦикла;
	
	СменитьСтатус = (ОбщееКоличествоСтрок = КоличествоСогласовавших);
	
	Возврат СменитьСтатус;
	
КонецФункции

// Функция добавляет статусы согласования по документуъ
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на документ.
//  ДополнительныеСвойства - Структура - доп. свойства.
Процедура ДобавитьНапоминанияПоСтатусамСогласования(СсылкаНаДокумент, ДополнительныеСвойства = Неопределено) 
	
	// Дополнительные свойства заполняются на форме перед записью документа.
	// В регистрах информация на этот момент может быть устаревшая, т.к. 
	// событие ПриЗаписи в форме документа (когда выполняется запись в регистры)
	// срабатывает после событий ПриЗаписи и ОбработкаПроведения в модуле объекта.
	// Но если запись выполнялась не из формы, то берем, что есть в регистрах.
	Если ДополнительныеСвойства <> Неопределено Тогда
		
		Если ДополнительныеСвойства.Свойство("СтатусДокумента") Тогда
			СтатусДокумента = ДополнительныеСвойства.СтатусДокумента;
		Иначе 
			СтатусДокумента = ПолучитьТекущийСтатусСогласованияДокумента(СсылкаНаДокумент); 
		КонецЕсли;
		
		Если ДополнительныеСвойства.Свойство("Согласующие") Тогда
			СогласующиеДокумента = ДополнительныеСвойства.Согласующие;
		Иначе 
			СогласующиеДокумента = ПолучитьТаблицуСогласующихДокумента(СсылкаНаДокумент);
		КонецЕсли;
		
	Иначе
		СтатусДокумента = ПолучитьТекущийСтатусСогласованияДокумента(СсылкаНаДокумент);
		СогласующиеДокумента = ПолучитьТаблицуСогласующихДокумента(СсылкаНаДокумент);
	КонецЕсли;
	
	ДеревоСогласования = ПолучитьДеревоСогласования(СсылкаНаДокумент.СпособСогласования, СтатусДокумента, СогласующиеДокумента);
	ТаблицаСогласующих = ПодготовитьТаблицуНапоминанийДляСогласующих(ДеревоСогласования);
	
	НаборЗаписейСогласования = РегистрыСведений.торо_СтатусыСогласованияДокументовРемонтныхРабот.СоздатьНаборЗаписей();
	НаборЗаписейСогласования.Отбор.СогласуемыйДокумент.Установить(СсылкаНаДокумент);
	НаборЗаписейСогласования.Записать();
	
	НаборЗаписейСогласования.Отбор.Статус.Установить(СтатусДокумента);
	НаборЗаписейСогласования.Отбор.Организация.Установить(СсылкаНаДокумент.Организация);
	
	Для Каждого СтрокаТЗ Из ТаблицаСогласующих Цикл
		НоваяЗапись = НаборЗаписейСогласования.Добавить();
		НоваяЗапись.Организация  = СсылкаНаДокумент.Организация;
		НоваяЗапись.СогласуемыйДокумент     = СсылкаНаДокумент;
		НоваяЗапись.Пользователь = СтрокаТЗ.Согласующий;
		НоваяЗапись.Статус       = СтатусДокумента;
		НоваяЗапись.НеНапоминать = СтрокаТЗ.НеНапоминать;
		НоваяЗапись.Дата         = СтрокаТЗ.Дата;
	КонецЦикла;
	
	НаборЗаписейСогласования.Записать();
	
КонецПроцедуры

Функция ПодготовитьТаблицуНапоминанийДляСогласующих(ДеревоСогласования)
	
	ТаблицаСогласующих = Новый ТаблицаЗначений;
	ТаблицаСогласующих.Колонки.Добавить("Согласующий", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	
	Для Каждого СтрокаСтатусов Из ДеревоСогласования.Строки Цикл
		Для Каждого СтрокаСогласующих Из СтрокаСтатусов.Строки Цикл
			НовСтрокаТЗ = ТаблицаСогласующих.Добавить();
			НовСтрокаТЗ.Согласующий = СтрокаСогласующих.Согласующий;
			
			Для Каждого СтрокаЗамещающих Из СтрокаСогласующих.Строки Цикл
				НовСтрокаТЗ = ТаблицаСогласующих.Добавить();
				НовСтрокаТЗ.Согласующий = СтрокаЗамещающих.Замещающий;
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла;
	
	ТаблицаСогласующих.Свернуть("Согласующий");
	ТаблицаСогласующих.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаСогласующих.Колонки.Добавить("НеНапоминать", Новый ОписаниеТипов("Булево"));
	
	Для Каждого СтрокаСогласующих Из ТаблицаСогласующих Цикл
		
		ОтключитьОповещение = Истина;
		
		// Этап 1 Проход по согласовавшим
		МассивСтрокСогласовавших = ДеревоСогласования.Строки.НайтиСтроки(Новый Структура("Согласующий, Замещающий", 
		СтрокаСогласующих.Согласующий, Справочники.Пользователи.ПустаяСсылка()), Истина);
		
		Для Каждого ЭлементМС Из МассивСтрокСогласовавших Цикл
			
			Если Не ЭлементМС.Согласовано Тогда
				
				ЕстьСогласованные = Ложь;
				Для Каждого СтрокаЗамещения Из ЭлементМС.Строки Цикл
					Если СтрокаЗамещения.Согласовано Тогда
						ЕстьСогласованные = Истина;
						Прервать;
					КонецЕсли; 
				КонецЦикла; 
				
				Если Не ЕстьСогласованные Тогда
					ОтключитьОповещение = Ложь;
					Прервать;
				КонецЕсли; 
				
			КонецЕсли; 	
			
		КонецЦикла; 		
		
		Если Не ОтключитьОповещение Тогда
			Продолжить;
		КонецЕсли;
		
		// Этап №2 Проход по замещающим
		МассивСтрокЗамещающих = ДеревоСогласования.Строки.НайтиСтроки(Новый Структура("Замещающий",
		СтрокаСогласующих.Согласующий), Истина);
		
		Для Каждого ЭлементМЗ Из МассивСтрокЗамещающих Цикл
			
			Если (Не ЭлементМЗ.Согласовано) И (Не ЭлементМЗ.Родитель.Согласовано) Тогда
				
				ЕстьСогласованные = Ложь;
				Для Каждого СтрокаЗамещения Из ЭлементМЗ.Родитель.Строки Цикл
					
					Если СтрокаЗамещения.Согласовано Тогда
						ЕстьСогласованные = Истина;
						Прервать;
					КонецЕсли; 
					
				КонецЦикла; 
				
				Если Не ЕстьСогласованные Тогда
					ОтключитьОповещение = Ложь;
					Прервать;
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла;
		
		Если Не ОтключитьОповещение Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСогласующих.Дата = ТекущаяДата();
		СтрокаСогласующих.НеНапоминать = Истина;
		
	КонецЦикла; 

	Возврат ТаблицаСогласующих;
	
КонецФункции

Процедура ЗаполнитьСвойстваДокументаПередЗаписьюБезОткрытияФормы(Источник, СтатусДокумента)
	
	Если НЕ ЗначениеЗаполнено(СтатусДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	ХранитьИсториюСогласованияВДокументах = Константы.торо_ХранитьИсториюСогласованияВДокументах.Получить();
	ДополнительныеСвойства = Источник.ДополнительныеСвойства;
	ТекущаяДата = ТекущаяДата();
	
	Если ХранитьИсториюСогласованияВДокументах Тогда
		Источник.СтатусДокумента = СтатусДокумента;
		
		НоваяЗаписьИС = Источник.ИсторияСтатусов.Добавить();
		НоваяЗаписьИС.Дата            = ТекущаяДата;
		НоваяЗаписьИС.Пользователь    = Пользователи.ТекущийПользователь();
		НоваяЗаписьИС.ЗаКого          = Неопределено;
		НоваяЗаписьИС.СтатусДокумента = СтатусДокумента;
	КонецЕсли;
	
	ИсторияСтатусовРегистр = РегистрыСведений.торо_ИсторияСтатусовСогласованияДокументов.СоздатьНаборЗаписей();
	НоваяЗаписьИС = ИсторияСтатусовРегистр.Добавить();
	НоваяЗаписьИС.Период          = ТекущаяДата;
	НоваяЗаписьИС.Пользователь    = Пользователи.ТекущийПользователь();
	НоваяЗаписьИС.ЗаКого          = Неопределено;
	НоваяЗаписьИС.СтатусДокумента = СтатусДокумента;

	СогласующиеРегистр = РегистрыСведений.торо_ТекущиеСогласующиеДокументов.СоздатьНаборЗаписей();
	ДеревоСогласования = ПолучитьДеревоСогласования(Источник.СпособСогласования, СтатусДокумента, СогласующиеРегистр.Выгрузить());
	
	МассивСогласованного = Новый Массив;		
	ЗаполнитьМассивИзДереваЗначений(МассивСогласованного, ДеревоСогласования.Строки);
	
	Для Каждого ЭлементМассива Из МассивСогласованного Цикл
		Если ЭлементМассива.Согласовано Тогда 
			ЗаполнитьЗначенияСвойств(СогласующиеРегистр.Добавить(), ЭлементМассива);
		КонецЕсли;
	КонецЦикла;
	
	ДополнительныеСвойства.Вставить("Записать_СтатусДокумента", Истина);
	ДополнительныеСвойства.Вставить("Записать_ИсторияСтатусовСогласования", Истина);
	ДополнительныеСвойства.Вставить("Записать_Согласующие", Истина);
	
	ДополнительныеСвойства.Вставить("ИсторияСтатусовСогласования", ИсторияСтатусовРегистр.Выгрузить());
	ДополнительныеСвойства.Вставить("Согласующие", СогласующиеРегистр.Выгрузить());
	
КонецПроцедуры

Процедура ЗаполнитьМассивИзДереваЗначений(Массив, СтрокиДерева) 
	
	Для каждого Строка Из СтрокиДерева Цикл
		Массив.Добавить(Строка);
		ЗаполнитьМассивИзДереваЗначений(Массив, Строка.Строки);
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти
